---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRightRunBoundary3d
source: html/60098ae4-3429-90f8-fe89-908129e25899.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRightRunBoundary3d Property

"Show Run's Right Boundary 3D"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRightRunBoundary3d { get; }
```